Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/evidence/evidence_introduction.html.txt.tmx
Source language: en
Languages: ga

source: In any court case, whether criminal or civil, evidence may be introduced by both sides
ga: Is féidir leis an dá thaobh in aon chás cúirte, bíodh sé coiriúil nó sibhialta, fianaise a tharraingt anuas

source: Evidence is something that tends to prove or disprove a particular fact - it makes the existence or non-existence of that fact more likely
ga: Rud a chuireann cuma na fírinne ar nó a bhréagnaíonn fíric faoi leith í fianaise - déanann sé an scéal níos cosúil go bhfuil nó nach bhfuil an fíric sin ann

source: The law of evidence lays down rules to decide what items of evidence may be introduced to prove facts in a trial
ga: Leagann dlí na fianaise síos rialacha le cinneadh a dhéanamh cén fhianaise gur féidir a tharraingt anuas le fíricí a chruthú i dtriail

source: An item of evidence is described as "inadmissible" if the law of evidence does not allow it to be introduced at a trial
ga: Deirtear go bhfuil píosa fianaise "neamhcheadaithe" muna féidir de réir dlí na fianaise é a tharraingt anuas i dtriail

source: Conversely, an item of evidence is described as "admissible" if the law of evidence allows it to be introduced to prove or disprove a particular fact
ga: Ar an láimh eile deirtear go bhfuil píosa fianaise "ceadaithe" más féidir de réir dlí na fianaise é a tharraingt anuas le fíric faoi leith a chruthú nó a bhréagnú

source: In this section, you will find information on a wide range of types of evidence and you will find out when those types of evidence may be admissible or inadmissible in a case
ga: Sa rannóg seo tá eolas ar fáil ar réimse leathan cineálacha fianaise agus inseofar duit cén uair a bhíonn na cineálacha fianaise sin ceadaithe nó neamhcheadaithe i gcás

source: We will consider the oral testimony of witnesses, real evidence and documentary evidence
ga: Breathnófar ar fhianaise bhéil ó fhinnéithe, fíor fhianaise agus fianaise scríofa

source: We will also consider hearsay evidence, circumstantial evidence, unlawfully obtained evidence, identification evidence and confessions
ga: Déanfar plé freisin ar fhianaise chlostráchta, fianaise imthoisceach, fianaise faighte go neamhdhleathach, fianaise aitheantais agus admhálacha

source: Some evidence may be relevant and it may be admissible but it may be privileged evidence so it cannot be introduced
ga: D'fhéadfadh fianaise a bheith ag baint leis an gcás agus ceadaithe ach d'fhéadfadh sí a bheith ina fianaise phribhléide agus mar sin nach féidir í a tharraingt anuas

source: Other evidence may be admissible but may be suspect evidence so that certain safeguards have to be put in place to protect the accused
ga: D'fhéadfadh fianaise eile a bheith ceadaithe ach gur fianaise amhrastúil í agus go bhfuil gá cosaintí a chur i bhfeidhm leis an gcúisí a chosaint

source: The rules on what may be admitted in evidence in a criminal trial are complex
ga: Tá rialacha casta ann faoin bhfianaise lenar féidir glacadh i dtriail choiriúil

source: The Criminal Justice Act 2006 provides for the admissibility of statements which were made by witnesses and which the witness subsequently refuses to stand over
ga: Forálann an tAcht um Cheartas Coiriúil 2006 gur féidir glacadh le ráitis a rinne finnéithe fiú má dhiúltaíonn an finné iad a dhearbhú níos déanaí

source: The court now has the power to decide whether or not to admit such a statement and the Act sets out guidelines for the court in making the decision
ga: Tá an chumhacht ag an gcúirt anois socrú an nglacfaidh nó nach nglacfaidh sí le ráiteas den sórt seo agus leagann an tAcht treoirlínte síos don chúirt chun cabhrú léi an socrú seo a dhéanamh

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
